# ForgeTypeId Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ForgeTypeId Methods
ForgeTypeId Class See Also
---
The ForgeTypeId type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clear | Sets the typeId to an empty string |
| Dispose |
| Empty | Checks if the typeId is an empty string |
| Equals | Determines whether this ForgeTypeId is equal to another.  (Overrides Object..::..Equals(Object).) |
| GetHashCode | Returns the hash code for this ForgeTypeId  (Overrides Object..::..GetHashCode()()()().) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| NameEquals | Returns true if the typeid string held by this ForgeTypeId is equal to that held by the given ForgeTypeId, excluding the version number. The version number of a typeid string follows a hyphen character. This function compares the typeid strings up to the first hyphen. This is the default equality comparison method for the ForgeTypeId class, used by the equality operator (==). |
| StrictlyEquals | Returns true if the entire typeid string held by this ForgeTypeId is exactly equal to that held by the given ForgeTypeId. For the default equality comparison used by the equality operator (==), see NameEquals(ForgeTypeId). |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ForgeTypeId Class
Autodesk.Revit.DB Namespace